Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And later he was seen by the eleven themselves while they were taking food; and he said sharp words to them because they had no faith and their hearts were hard, and because they had no belief in those who had seen him after he had come back from the dead.
chr: ᎣᏂᏃ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎴ ᏌᏚ ᎢᏯᏂᏛ ᎠᎾᎵᏍᏓᏴᎲᏍᎬᎢ, ᎠᎴ ᏚᎬᏍᎪᎸᏁ ᏂᎦᎵᏍᏙᏗᏍᎨ ᏄᏃᎯᏳᏒᎾ ᎨᏒ ᎠᎴ ᏗᏍᏓᏱᏳ ᎨᏒ ᏧᏂᎾᏫ, ᏂᏚᏃᎯᏳᏅᎾ ᎨᏒ ᎢᏳᏍᏗ ᎾᏍᎩ ᎬᏩᎪᎲᎯ ᏧᎴᎯᏌᏅᎯ ᏂᎨᏎᎢ.

source: And he said to them, Go into all the world, and give the good news to everyone.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎢᏤᏙᎾ ᎡᎶᎯ ᏂᎬᎾᏛᎢ, ᎠᎴ ᏫᏗᏣᎵᏥᏙᎲᏏ ᎣᏍᏛ ᎧᏃᎮᏛ ᎾᏂᎥ ᎨᎪᏢᏅᎯ.

source: He who has faith and is given baptism will get salvation; but he who has not faith will be judged.
chr: ᎩᎶ ᎪᎯᏳᎲᏍᎨᏍᏗ ᎠᎴ ᎠᎦᏬᏍᎨᏍᏗ ᎠᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ; ᏂᎪᎯᏳᎲᏍᎬᎾᏍᎩᏂ ᏣᎫᎪᏓᏁᏗ ᎨᏎᏍᏗ.

source: And these signs will be with those who have faith: in my name they will send out evil spirits; and they will make use of new languages;
chr: ᎯᎠᏃ ᎾᏍᎩ ᎤᏰᎸᏛ ᏗᎪᎵᏍᏙᏗ ᏔᎵ ᏚᏛᏗᏕᎨᏍᏗ ᎠᏃᎯᏳᎲᏍᎩ; ᎠᏴ ᏓᏆᏙᎥ ᎠᏅᏗᏍᎨᏍᏗ ᎠᏂᏍᎩᎾ ᏓᏂᏄᎪᏫᏍᎨᏍᏗ; ᏅᏩᎾᏓᎴ ᏧᏂᏬᏂᎯᏍᏗ ᏓᏂᏬᏂᏍᎨᏍᏗ;

source: They will take up snakes, and if there is poison in their drink, it will do them no evil; they will put their hands on those who are ill, and they will get well.
chr: ᎢᎾᏛ ᏓᏂᏁᏍᎨᏍᏗ; ᎢᏳ ᎠᎴ ᎪᎱᏍᏗ ᎠᏓᎯᎯ ᏳᎾᏗᏔᎲ, ᎥᏝ ᎪᎱᏍᏗ ᏳᏅᏁᎮᏍᏗ; ᏧᏂᏢᎩ ᏓᎾᏏᏔᏗᏍᎨᏍᏗ, ᎠᎴ ᏚᎾᏗᏩᏍᎨᏍᏗ.

source: So then the Lord Jesus, after he had said these words to them, was taken up into heaven and took his seat at the right hand of God.
chr: ᎾᏍᎩᏃ ᎤᎬᏫᏳᎯ ᏚᏬᏁᏔᏅ, ᎦᎸᎳᏗ ᏙᏣᏕᏓᏂᎸᏤᎢ, ᎠᎴ ᎠᎦᏘᏏ ᎢᏗᏢ ᎤᏁᎳᏅᎯ ᎤᏬᎸ ᎤᏪᏁᎢ.

source: And they went out, preaching everywhere, the Lord working with them, and giving witness to the word by the signs which came after. So be it.
chr: ᎤᏁᏅᏎᏃ ᎠᎴ ᏂᎬᎾᏛ ᎤᎾᎵᏥᏙᏂᏙᎴᎢ, ᎤᎬᏫᏳᎯ ᏔᎵ ᎤᏛᏗᏕᎨ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ, ᎠᎴ ᎠᏂᏁᎬ ᎠᏍᏓᏱᏗᏍᏗᏍᎨ ᎤᏰᎸᏛ ᎤᎵᏠᏯᏍᏗᏕᎬᎢ. ᎡᎺᏅ.

source: Gospel of Luke
chr: ᎣᏍᏛ ᎧᏃᎮᏛ ᎷᎦ ᎤᏬᏪᎳᏅᎯ

source: As a number of attempts have been made to put together in order an account of those events which took place among us,
chr: ᎾᏍᎩᏃ ᎠᏂᎪᏗᏳ ᏧᎾᏁᎶᏔᏅ ᎬᏂᎨᏒ ᎢᏳᏅᏁᏗᏱ ᎧᏃᎲᏍᎩ ᏧᏓᎴᏅᏛ ᏄᎵᏍᏔᏂᏙᎸ ᎾᏍᎩ ᎤᏙᎯᏳᎯᏯ ᏦᎪᎯᏳᎭ,

source: As they were handed down to us by those who saw them from the first and were preachers of the word,
chr: ᎾᏍᎩᏯ ᏂᎪᎩᏪᏎᎸ ᎾᏍᎩ ᏗᏓᎴᏂᏍᎬ ᏅᏓᎬᏩᏓᎴᏅᏛ ᎤᏅᏒ ᎤᏂᎪᎯᏙᎸᎯ, ᎠᎴ ᎧᏃᎮᏛ ᎤᎾᎵᏥᏙᏅᎯ ᎨᏒᎢ^

source: It seemed good to me, having made observation, with great care, of the direction of events in their order, to put the facts in writing for you, most noble Theophilus;
chr: ᎾᏍᏉ ᎠᏴ ᎣᏏᏳ ᎠᎩᏰᎸᏅ ᏫᎬᏲᏪᎳᏁᏗᏱ ᎣᏍᏛ ᎠᎩᏰᎢᎸᏍᏗᏱ, ᏂᎯ ᎡᏣᎸᏉᏗ ᏗᎣᏈᎵ, ᎠᎩᏍᏆᏂᏰᏛᏰᏃ ᏂᎦᏛ ᎯᎠ ᏧᏓᎴᏅᏛ ᏗᏓᎴᏂᏍᎬ ᏅᏓᎬᏩᏓᎴᏅᏛ,

source: So that you might have certain knowledge of those things about which you were given teaching.
chr: ᎾᏍᎩ ᏣᎦᏙᎥᎯᏍᏗᏱ ᎤᏙᎯᏳᎯᏯ ᎨᏒ ᎾᏍᎩ ᎾᎿ ᏧᏓᎴᏅᏛ ᎡᏤᏲᏅᎢ.

source: In the days of Herod, king of Judaea, there was a certain priest, by name Zacharias, of the order of Abijah; and he had a wife of the family of Aaron, and her name was Elisabeth.
chr: ᎾᎯᏳ ᎡᎶᏛ ᎤᎬᏫᏳᎯ ᎨᏎ ᏧᏗᏱ, ᎩᎶ ᎢᏳᏍᏗ ᎡᎮ ᎠᏥᎸ-ᎨᎶᎯ ᏤᎦᎳᏯ ᏧᏙᎢᏛ, ᎾᏍᎩ ᎡᏆᏯ ᎠᎦᏘᏅᏔᏅ ᎨᎳ ᎨᏎᎢ, ᎤᏓᎵᎢᏃ ᎡᎳᏂ ᏧᏪᏥᏛᎯ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᎨᏎᎢ, ᎠᎴ ᎵᏏ ᏚᏙᎡᎢ.

source: They were upright in the eyes of God, keeping all the rules and orders of God, and doing no wrong.
chr: ᎠᎴ ᎢᏧᎳ ᏚᏳᎪᏛ ᏧᏂᎸᏫᏍᏓᏁᎯ ᎨᏎ ᎤᏁᎳᏅᎯ ᏙᏗᎧᏅᎢ, ᏓᏂᎧᎿᏩᏗᏎ ᏂᎦᏛ ᏗᎧᎿᏩᏛᏍᏗ ᎠᎴ ᎤᎵᏁᏨ ᎢᏯᏛᏁᎵᏓᏍᏗ ᎨᏒ ᏱᎰᏩ ᏧᏤᎵᎦ, ᎤᏐᏅ ᏂᎨᏥᎳᎾᏎᎲᎾ.

source: And they were without children, because Elisabeth had never given birth, and they were at that time very old.
chr: ᎠᎴ ᏁᎲᎾ ᎨᏎ ᎤᏁᏥ, ᎵᏏᏰᏃ ᎥᏝ ᏱᏓᎷᎸᎥᏍᎨᎢ, ᎠᎴ ᎢᏧᎳ ᎿᏉ ᎠᏂᎦᏴᎵᎨ ᎨᏎᎢ.

source: Now it came about that in his turn he was acting as priest before God,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎠᏥᎸᎨᎶᎯ ᏧᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏚᎸᏫᏍᏓᏁᎮ ᎤᎮᎳᏅᎯ ᎠᎦᏔᎲᎢ, ᎾᎯᏳ ᎤᎵᏱᎶᎸ ᏧᏂᎸᏫᏍᏓᏁᏗᏱ ᎾᎿ ᎨᎸᎢ,

source: And as was the way of the priests, he had to go into the Temple to see to the burning of perfumes.
chr: ᎾᏍᎩ ᎢᏳᎾᏛᏁᏗ ᎨᏒ ᎠᏥᎸᎠᏁᎶᎯ, ᎾᏍᎩ ᎤᏩᏙᏗ ᏂᎦᎵᏍᏗᏍᎨ ᎠᏜ ᎦᏩᏒᎩ ᎾᎯᏳ ᏩᏴᎭ ᏱᎰᏩ ᎤᏤᎵ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ.

source: And all the people were offering prayers outside, at the time of the burning of perfumes.
chr: ᎤᏂᏣᏘᏃ ᏴᏫ ᏙᏱᏗᏢ ᎠᎾᏓᏙᎵᏍᏗᏍᎨ ᎾᎯᏳ ᎠᏜ ᎦᏩᏒᎩ ᎬᏙᏗᏱ ᎤᏍᏆᎸᎲ.

source: And he saw an angel of the Lord in his place on the right side of the altar.
chr: ᏱᎰᏩᏃ ᎤᏤᎵ ᏗᎧᎿᏩᏗᏙᎯ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎦᏙᎨ ᎠᎦᏘᏏᏗᏢ ᎦᏩᏒᎩ ᎬᏙᏗᏱ ᎪᏢᏒᎢ.

source: And Zacharias was troubled when he saw him, and fear came on him.
chr: ᏤᎦᎳᏯᏃ ᎤᎪᎲ, ᎤᏕᏯᏔᏁᎴ ᎠᎴ ᎤᏍᎦᎴᎢ.

source: But the angel said, Have no fear, Zacharias, for your prayer has come to the ears of God, and your wife Elisabeth will have a son, and his name will be John.
chr: ᎠᏎᏃ ᏗᎧᎿᏩᏗᏙᎯ ᎯᎠ ᏄᏪᏎᎴᎢ; ᏤᎦᎳᏯ ᏞᏍᏗ ᏣᏍᎦᎸᎩ; ᎭᏓᏙᎵᏍᏗᏍᎬᏰᏃ ᎡᏣᏛᎦᏁᎸ; ᎠᎴ ᏣᏓᎵᎢ ᎵᏏ ᏓᏣᎾᏄᎪᏫᏎᎵ ᏤᏥ ᎠᏧᏣ, ᏣᏂᏃ ᏕᎯᏲᎥᎭ.

source: And you will be glad and have great delight; and numbers of people will have joy at his birth.
chr: ᎠᎴ ᎭᎵᎮᎵᎨᏍᏗ ᎠᎴ ᎣᏍᏛ ᏣᏰᎸᏎᏍᏗ; ᎠᎴ ᎤᏂᏣᏘ ᎠᎾᎵᎮᎵᎨᏍᏗ ᎤᏕᏅ ᎢᏳᏍᏗ.

source: For he will be great in the eyes of the Lord; he will not take wine or strong drink; and he will be full of the Spirit of God from his birth.
chr: ᎠᎴ ᎠᏥᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏱᎰᏩ ᏙᏗᎧᏅᎢ, ᎥᏝ ᎠᎴ ᎤᏗᏔᏍᏗ ᏱᎨᏎᏍᏗ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎠᎴ ᎠᏓᏴᏍᏕᏍᏗᏍᎩ; ᎠᎴ ᎤᎧᎵᏨᎯ ᎨᏎᏍᏗ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎤᏥ ᎤᎾᏅᎪᏫᏒ ᎤᏓᎬᏩᏓᎴᏅᏛ.

source: And through him great numbers of the children of Israel will be turned to the Lord their God.
chr: ᎠᎴ ᎤᏂᏣᏘ ᎢᏏᎵ ᏧᏪᏥ ᏙᏛᎪᎸᏏ ᏱᎰᏩ ᎤᎾᏁᎳᏅᎯ ᎢᏗᏢ ᏙᏛᎦᏔᎲᏍᏔᏂ.

source: And he will go before his face in the spirit and power of Elijah, turning the hearts of fathers to their children, and wrongdoers to the way of righteousness; to make ready a people whose hearts have been turned to the Lord.
chr: ᎠᎴ ᎢᎬᏱ ᏓᏳᏪᏅᎡᎵ [ᎤᎬᏫᏳᎯ] ᎢᎳᏯ ᎾᏍᎩᏯ ᎨᏎᏍᏗ ᎤᏓᏅᏙᎩ ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏒᎢ, ᏧᎦᏔᎲᏍᏗᏱ ᏧᏂᎾᏫ ᎠᏂᎦᏴᎵᎨᎢ ᏗᏂᏲᎵ ᎢᏗᏢ ᏫᏚᎦᏔᎲᏍᏙᏗᏱ, ᎠᎴ ᏄᏃᎯᏳᏒᎾ ᏧᎦᏔᎲᏍᏗᏱ ᎤᎾᏓᏅᏘ ᎠᏂᎦᏔᎿᎥ ᎢᏗᏢ ᏫᏚᎦᏔᎲᏍᏙᏗᏱ; ᏧᏛᏅᎢᏍᏙᏗᏱ ᏴᏫ, ᎤᎬᏫᏳᎯ ᏧᏛᏅᎢᏍᏓᏁᏗᏱ.

source: And Zacharias said to the angel, How may I be certain of this? For I am an old man, and my wife is far on in years.
chr: ᏤᎦᎳᏯᏃ ᎯᎠ ᏄᏪᏎᎴ ᏗᎧᎿᏩᏗᏙᎯ, ᎦᏙᏃ ᎠᏆᏙᎴᎰᎯᏍᏙᏗ ᎨᏎᏍᏗ ᎾᏍᎩ ᎯᎠ? ᎠᏆᏛᏐᏅᎯᏰᏃ, ᎠᎴ ᎠᏆᏓᎵᎢ ᎿᏉ ᎠᎦᏴᎵᎨᎢ.

source: And the angel, answering, said, I am Gabriel, whose place is before God; I have been sent to say these words to you and to give you this good news.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎠᏴ ᎨᏈᎵ, ᏥᏥᏙᎪ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ; ᎠᎴ ᏨᎩᏅᏒ ᎬᏯᎵᏃᎮᏙᏗᏱ, ᎠᎴ ᎬᎾᏄᎪᏫᏎᏗᏱ ᎯᎠ ᎾᏍᎩ ᎣᏍᏛ ᎧᏃᎮᏛ.

source: Now, see, you will be without voice or language till the day when these things come about, because you had not faith in my words, which will have effect at the right time.
chr: ᎠᎴ ᎬᏂᏳᏉ ᏨᎨᏫ ᎨᏎᏍᏗ, ᎠᎴ ᎨᏣᏁᎢᏍᏗ ᏂᎨᏒᎾ ᎨᏎᏍᏗ ᎬᏂ ᎾᎯᏳ ᎢᎦ ᎾᏍᎩ ᎯᎠ ᏂᎦᎵᏍᏔᏅᎭ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᏂᏦᎯᏳᏅᎾ ᎨᏒ ᏥᏁᎬᎢ, ᎾᏍᎩ ᎠᏎ ᎢᏳᎵᏍᏙᏗ ᏥᎩ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏍᏆᎸᎲᎭ.

source: And the people were waiting for Zacharias and were surprised because he was in the Temple for such a long time.
chr: ᏴᏫᏃ ᎬᏩᎦᏘᏰ ᏤᎦᎳᏯ, ᎠᎴ ᎤᏂᏍᏆᏂᎪᏍᎨ ᎪᎯᏗᏳ ᏩᏯᎥ ᎤᏛᏅᏗᎦᎳᏫᎢᏍᏗᏱ.

source: And when he came out he was not able to say anything, and they saw that he had seen a vision in the Temple; and he was making signs to them without words.
chr: ᏧᏄᎪᏨᏃ ᎥᏝ ᏗᎬᏩᎵᏃᎮᏙᏗ ᏱᎨᏎᎢ; ᎤᎾᏙᎴᎰᏎᏃ ᎤᏁᎳᏫᏎᎸ ᏩᏯᎥ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ. ᏓᏁᎶᏓᏁᎮᏃ ᎠᎴ ᏅᏩᏍᏕᏉ ᎤᏩᎨᏫ ᎨᏎᎢ.

source: And when the days of his work in the Temple were ended, he went back to his house.
chr: ᎠᎴ ᎯᎠ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎿᏉ ᎤᏍᏆᏛ ᎠᏎᎸᎯ ᎨᏒ ᎢᎪᎯᏛ ᏧᎸᏫᏍᏓᏁᏗᏱ, ᎤᏪᏅᏎ ᏧᏪᏅᏒᎢ.

source: After that time, Elisabeth, being certain that she was to become a mother, kept herself from men's eyes for five months, saying,
chr: ᎣᏂᏃ ᎢᏴᏛ ᎤᏓᎵᎢ ᎵᏏ ᎤᏁᎵᏤᎢ, ᎠᎴ ᎤᏗᏍᎦᎳᏁ ᎯᏍᎩ ᎢᏯᏅᏙ, ᎯᎠ ᏄᏪᏎᎢ,

source: The Lord has done this to me, for his eyes were on me, to take away my shame in the eyes of men.
chr: ᎯᎠ ᎾᏍᎩ ᎾᏆᏛᏁᎸ ᏱᎰᏩ ᎾᎯᏳ ᎢᎦ ᏕᎠᏆᎧᎿᏅ, ᎠᎩᎲᎡᏗᏱ ᎤᏕᎰᎯᏍᏗ ᎥᏆᏓᏅᏖᏗᏱ ᏴᏫ ᎠᏁᎲᎢ.

source: Now in the sixth month the angel Gabriel was sent from God to a town in Galilee, named Nazareth,
chr: ᏑᏓᎵᏁᏃ ᎧᎸᎢ ᏗᎧᎿᏩᏗᏙᎯ ᎨᏈᎵ ᎤᏁᎳᏅᎯ ᏅᏓᏳᏅᏏᏛ ᎤᎷᏤ ᎦᏚᎲ ᎨᎵᎵ ᎾᏎᎵᏗ ᏧᏙᎢᏛ,

source: To a virgin who was to be married to a man named Joseph, of the family of David; and the name of the virgin was Mary.
chr: ᎤᎷᏤᎴ ᎠᏛ ᎾᏍᎩ ᏦᏩ ᏧᏙᎢᏛ ᎠᏍᎦᏯ ᎤᏓᏴᏍᏗ, ᎾᏍᎩ ᏕᏫ ᎤᏁᏢᏔᏅᏛ ᏅᏓᏳᏓᎴᏅᎯ ᎨᏎᎢ; ᎾᏍᎩᏃ ᎠᏛ ᎺᎵ ᏧᏙᎢᏛ ᎨᏎᎢ.

source: And the angel came in to her and said, Peace be with you, to whom special grace has been given; the Lord is with you.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎤᎷᏤᎸ ᎯᎠ ᏄᏪᏎᎢ; ᎬᏲᎵᎦ ᏂᎯ ᎡᏣᎸᏉᏔᏅᎯ, ᏱᎰᏩ ᏫᏗᏣᎧᎿᏩᏗᏓ; ᎠᏂᎨᏴ ᎠᏁᎲ ᏂᎯ ᏭᏓᎪᎾᏛᏗ ᎣᏏᏳ ᎢᏣᎵᏍᏓᏁᏗ.

source: But she was greatly troubled at his words, and said to herself, What may be the purpose of these words?
chr: ᎤᎪᎲᏃ ᎤᏕᏯᏔᏁᎴ ᎾᏍᎩ ᏄᏪᏎᎸᎢ, ᎠᎴ ᎤᏓᏅᏖᎴ ᏄᏍᏛ ᎤᏰᎸᏛ ᎯᎠ ᎾᏍᎩ ᎤᏲᎵᎸᎢ.

source: And the angel said to her, Have no fear, Mary, for you have God's approval.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎺᎵ ᏞᏍᏗ ᏣᏍᎦᎸᎩ; ᎤᏁᎳᏅᎯᏰᏃ ᎣᏍᏛ ᏣᏰᎸᏗ ᎨᏒ ᏣᏩᏛᎲ.

source: And see, you will give birth to a son, and his name will be Jesus.
chr: ᎠᎴ ᎬᏂᏳᏉ ᏘᏁᎵᏥ, ᎠᎴ ᏘᎾᏄᎪᏫᏏ ᎠᏧᏣ, ᎠᎴ ᏥᏌ ᏙᏘᏲᎢ.

source: He will be great, and will be named the Son of the Most High: and the Lord God will give him the kingdom of David, his father:
chr: ᎠᏥᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎾᏍᎩ, ᎠᎴ ᏩᏍᏛ ᎦᎸᎳᏗᏳ ᎡᎯ ᎤᏪᏥ ᎠᎪᏎᎮᏍᏗ; ᏱᎰᏩᏃ ᎤᏁᎳᏅᎯ ᏓᏳᏁᎵ ᎤᏙᏓ ᏕᏫ ᎤᏪᏍᎩᎸᎢ.

source: He will have rule over the house of Jacob for ever, and of his kingdom there will be no end.
chr: ᎠᎴ ᏫᎾᏍᏛᎾ ᎤᎬᏫᏳᎯ ᎨᏎᏍᏗ ᏤᎦᏈ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᎠᏁᎲᎢ; ᎠᎴ ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᎨᏒ ᏭᏍᏗᏥᎯᏍᏗ ᏂᎨᏒᎾ ᎨᏎᏍᏗ.

source: And Mary said to the angel, How may this be, because I have had no knowledge of a man?
chr: ᎺᎵᏃ ᎯᎠ ᏄᏪᏎᎴ ᏗᎧᎿᏩᏗᏙᎯ; ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᎾᏍᎩ ᏱᏂᎦᎵᏍᏓ, ᏂᏥᎦᏔᎲᎾᏃ ᏥᎩ ᎠᏍᎦᏯ?

source: And the angel in answer said to her, The Holy Spirit will come on you, and the power of the Most High will come to rest on you, and so that which will come to birth will be named holy, Son of God.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᏓᏣᎷᏤᎵ ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᏩᏍᏛ ᎦᎸᎳᏗᏳ ᎡᎯ ᏓᏣᏓᏩᏗᏍᏙᏔᏂ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᏍᏉ ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᏨᏓᏣᏕᏁᎵ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎠᎪᏎᎮᏍᏗ.

source: Even now Elisabeth, who is of your family, is to be a mother, though she is old: and this is the sixth month with her who was without children.
chr: ᎠᎴ ᎬᏂᏳᏉ ᎢᏍᏗᏠᏱ ᎵᏏ ᎾᏍᏉ ᎠᏧᏣ ᎤᏁᎵᏨ ᎿᏉ ᎠᎦᏴᎵᎨ ᎨᏒᎢ; ᎠᎴ ᎪᎯ ᏥᎩ ᎿᏉ ᏑᏓᎵᏁ ᎧᎳ ᎬᏩᏁᎵᏨᎯ ᎾᏍᎩ ᏗᎷᎸᎥᏍᎩ ᏂᎨᏒᎾ ᏣᎪᏎᎲᎩ.

source: For there is nothing which God is not able to do.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎥᏝ ᎪᎱᏍᏗ ᎤᏄᎸᏗ ᏱᎨᏎᏍᏗ.

source: And Mary said: I am the servant of the Lord; may it be to me as you say. And the angel went away.
chr: ᎺᎵᏃ ᎯᎠ ᏄᏪᏎᎢ; ᎬᏂᏳᏉ ᎠᏉ ᎤᏅᏏᏓᏍᏗ ᎠᎨᏴ; ᏱᎰᏩ ᎾᏍᎩᏯ ᏂᏣᏪᏒ ᏫᎾᏆᎵᏍᏓᏏ. ᏗᎧᎿᏩᏗᏙᎯᏃ ᎤᏓᏅᎡᎴᎢ.

source: Then Mary got up and went quickly into the high lands, to a town of Judah;
chr: ᎺᎵᏃ ᎾᎯᏳ ᏚᎴᏁᎢ, ᎤᏩᏅᏤ ᎣᏓᎵ ᎨᏒ ᏭᎶᏎᎢ, ᏧᏗᏱ ᎦᏚᎲ ᏭᎷᏤᎢ;

source: And went into the house of Zacharias and took Elisabeth in her arms.
chr: ᎠᎴ ᏭᏴᎴ ᏤᎦᎳᏯ ᎦᏁᎸᎢ, ᎠᎴ ᎤᏲᎵᎴ ᎵᏏ

source: And when the voice of Mary came to the ears of Elisabeth, the baby made a sudden move inside her; then Elisabeth was full of the Holy Spirit,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎵᏏ ᎤᏛᎦᏅ ᎺᎵ ᎤᏲᎵᎲᎢ, ᎠᏲᎵ ᎦᏁᎵᏒ ᎤᎵᏖᎸᏁᎢ; ᎠᎴ ᎵᏏ ᎤᎧᎵᏤ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ,

source: And she said with a loud voice: May blessing be on you among women, and a blessing on the child of your body.
chr: ᎠᎴ ᎠᏍᏓᏯ ᎤᏁᏤᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎠᏂᎨᏴ ᎠᏁᎲ ᏂᎯ ᏭᏓᎪᎾᏛᏗ ᎡᏣᎸᏉᏗᏳ; ᎠᎴ ᎦᎸᏉᏗᏳ ᎾᏍᎩ ᏂᎯ ᏨᏘᎾᏄᎪᏫᏏ.

source: How is it that the mother of my Lord comes to me?
chr: ᎦᏙᏃ ᏓᎦᎵᏍᏙᏓ ᎠᏴ ᎾᏍᎩ ᏥᎾᏆᎵᏍᏓᏏ, ᎾᏍᎩ ᎠᏆᏤᎵ ᎤᎬᏫᏳᎯ ᎤᏥ ᏣᎩᎷᏥᏏ?

source: For, truly, when the sound of your voice came to my ears, the baby in my body made a sudden move for joy.
chr: ᎬᏂᏳᏉᏰᏃ ᎠᏆᏛᎦᏅᏉ ᎯᏁᎬ ᏍᎩᏲᎵᎲᎢ, ᎠᏲᎵ ᏥᏁᎵᏒ ᎤᎵᏖᎸᏅ ᎠᎵᎮᎵᎬᎢ.

source: Happy will she be who had faith that the things which the Lord has said to her will be done.
chr: ᎠᎴ ᎣᏏᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎤᏬᎯᏳᏅᎯ; ᎾᏍᎩᏰᏃ ᏅᏧᏪᏎᎸ ᏱᎰᏩ ᎾᏍᎩ ᎠᏎ ᏅᏓᎦᎵᏍᏔᏂ.

source: And Mary said: My soul gives glory to God;
chr: ᎺᎵᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎠᏆᏓᏅᏙ ᎤᏣᏘ ᎦᎸᏉᏗᎭ ᏱᎰᏩ,

source: My spirit is glad in God my Saviour.
chr: ᎠᎴ ᎠᏆᏓᏅᏙ ᎤᎵᎮᎵᏤᎸ ᎤᏁᎳᏅᎯ ᎠᎩᏍᏕᎵᏍᎩ.

source: For he has had pity on his servant, though she is poor and lowly placed: and from this hour will all generations give witness to the blessing which has come to me.
chr: ᏕᎤᎧᎿᏅᏰᏃ ᎤᏲ ᏄᏛᎿᏕᎬ ᎠᎨᏴ ᎤᏅᏏᏓᏍᏗ; ᎬᏂᏳᏉᏰᏃ ᎪᎯ ᎢᏳᏓᎴᏅᏛ ᎾᎾᏓᏁᏟᏴᏏᏒ ᏴᏫ ᎦᎸᏉᏗᏳ ᎬᏉᏎᎮᏍᏗ.

source: For he who is strong has done great things for me; and holy is his name.
chr: ᎤᎵᏂᎩᏛᏰᏃ ᏥᎩ ᎾᏍᎩ ᎤᏍᏆᏂᎪᏗᏳ ᎾᏆᏛᏁᎸ; ᎠᎴ ᎦᎸᏉᏗᏳ ᎾᏍᎩ ᏕᎤᏙᎥᎢ.

source: His mercy is for all generations in whom is the fear of him.
chr: ᎠᎴ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏕᎦᎾᏄᎪᏫᏎᎭ ᎬᏩᎾᏰᏍᎩ ᎾᎾᏓᏁᏟᏴᏏᏒᎢ.

source: With his arm he has done acts of power; he has put to flight those who have pride in their hearts.
chr: ᎧᏃᎨᏂ ᎤᏮᏔᏅ ᎤᎾᏄᎪᏫᏒ ᎤᎵᏂᎩᏛ ᎨᏒᎢ; ᎤᎾᏢᏉᏗ ᏙᏧᎾᏓᏅᏛ ᏚᏗᎦᎴᏯᏍᏔᏅ.

source: He has put down kings from their seats, lifting up on high the men of low degree.
chr: ᏧᎾᎵᏂᎩᏛ ᏚᏪᎧᎲᏒ ᎤᎾᏅᏗᏱ, ᎠᎴ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ ᏚᏌᎳᏓᏅ.

source: Those who had no food he made full of good things; the men of wealth he sent away with nothing in their hands;
chr: ᎠᎪᏄ ᏧᏂᏲᏏᏍᎩ ᎣᏍᏛ ᎨᏒ ᏚᎧᎵᎢᏍᏔᏅ, ᏧᏁᎿᎢᏃ ᎠᏒᎭ ᏙᎤᏁᏅᏍᏗᏱ ᏂᏚᏩᏁᎸᎩ.

source: His help he has given to Israel, his servant, so that he might keep in mind his mercy to Abraham and his seed for ever,
chr: ᎢᏏᎵ ᎤᏅᏏᏓᏍᏗ ᎤᏍᏕᎸᎲ ᎠᏅᏓᏗᏍᎬ ᎤᏓᏙᎵᏣᏛᎢ,

source: As he gave his word to our fathers.
chr: ᎾᏍᎩᏯ ᏂᏚᏪᏎᎸ ᏗᎩᎦᏴᎵᎨᎢ, ᎡᏆᎭᎻ, ᎠᎴ ᎾᏍᎩ ᏧᏁᏢᏔᏅᏛ ᎨᏒ ᏂᎪᎯᎸᎢ.

source: And Mary was with her for about three months and then went back to her house.
chr: ᎺᎵᏃ ᏦᎢ ᎢᏯᏅᏙ ᎢᏴᏛ ᎵᏏᏱ ᎤᏕᏁᎢ, ᎩᎳᏃ ᎤᏩᏒ ᏧᏪᏅᏒ ᏫᎤᎶᏎᎢ.

source: Now it was time for Elisabeth to give birth, and she had a son.
chr: ᎵᏏᏃ ᎿᏉ ᎤᏍᏆᎸᎡᎴ ᎤᏕᏗᏱ ᎠᏲᎵ, ᎠᎴ ᎤᎾᏄᎪᏫᏎ ᎠᏧᏣ.

source: And it came to the ears of her neighbours and relations that the Lord had been very good to her, and they took part in her joy.
chr: ᎾᎥᏃ ᎢᏳᎾᏓᎳ ᎠᎴ ᎪᎱᏍᏗ ᏧᏩᎿ ᎤᎾᏛᎦᏁ ᎤᏁᎳᏅᎯ ᎤᏣᏘ ᎤᏪᏙᎵᏨᎢ, ᎠᎴ ᎢᏧᎳᎭ ᎤᎾᎵᎮᎵᏤᎢ.

source: And on the eighth day they came to see to the circumcision of the child, and they would have given him the name of Zacharias, his father's name;
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᏧᏁᎵᏁ ᎢᎦ ᎤᏂᎱᏍᏕᏎᎸᎭ ᎠᏲᎵ, ᎠᎴ ᏤᎦᎳᏯ ᏚᏃᎡᎢ, ᎤᏙᏓ ᏚᏙᎥ ᏚᏃᏍᏔᏁᎢ.

source: But his mother made answer and said, No, his name is John.
chr: ᎤᏥᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ; ᎥᏞᏍᏗ; ᏣᏂᏍᎩᏂ ᎠᎪᏎᎮᏍᏗ.

source: And they said, Not one of your relations has that name.
chr: ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ; ᎥᏝ ᎩᎶ ᎢᏥᏠᏱ ᎨᏒ ᎾᏍᎩ ᏱᏄᏍᏗ ᏱᏚᏙᎥ.

source: And they made signs to his father, to say what name was to be given to him.
chr: ᎤᏙᏓᏃ ᏓᎾᏁᎶᏓᏁᎲ ᎤᎾᏛᏛᏁ ᏄᏍᏛ ᎤᏚᎵᏍᎬ ᏣᎪᏍᏗᏱ.

source: And he sent for writing materials and put down: His name is John; and they were all surprised.
chr: ᎤᏔᏲᎴᏃ ᏗᎪᏪᎶᏗᏱ ᎠᎴ ᎤᏬᏪᎳᏁ ᎯᎠ ᏂᎦᏪᏍᎨᎢ; ᏣᏂ ᏚᏙᎥ. ᏂᎦᏛᏃ ᎤᏂᏍᏆᏂᎪᏎᎢ.

source: And straight away his mouth was open and his tongue was free and he gave praise to God.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎠᎱᎵ ᎤᎵᏍᏚᎢᏎᎢ, ᎦᏃᎪᏃ ᎤᏕᎵᏌᏕᏎᎢ, ᎠᎴ ᎤᏬᏂᏎ ᎤᎸᏉᏔᏁ ᎤᏁᎳᏅᎯ.

source: And fear came on all those who were living round about them: and there was much talk about all these things in all the hill-country of Judaea.
chr: ᎾᎿᏃ ᎬᏩᏚᏫᏛ ᏗᏂᏁᎸ ᏂᎦᏛ ᎤᏂᎾᏰᏎᎢ; ᎠᎴ ᏂᎦᏛ ᎾᏍᎩ ᎯᎠ ᏄᎵᏍᏔᏂᏙᎸ ᏚᏃᏣᎶᏤ ᏂᎬᎾᏛ ᎣᏓᎵ ᎨᏒ ᏧᏗᏱ.

source: And all who had word of them kept them in their minds and said, What will this child be? For the hand of the Lord was with him.
chr: ᎾᏂᎥᏃ ᎾᏍᎩ ᎤᎾᏛᎦᏅᎯ ᏧᏂᎾᏫᏱ ᎤᏂᏍᏆᏂᎪᏔᏁᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ; ᎦᏙ ᎤᏍᏕᏍᏗ ᎯᎠ ᎠᏲᎵ? ᏱᎰᏩᏃ ᎤᏍᏕᎸᎯᏙᎮᎢ.

source: And his father, Zacharias, was full of the Holy Spirit, and with the voice of a prophet said these words:
chr: ᎤᏙᏓᏃ ᏤᎦᎳᏯ ᎤᎧᎵᏨᎯ ᎨᏎ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎠᎴ ᎤᏙᎴᎰᏎ ᎯᎠ ᏄᏪᏎᎢ;

source: Praise be to the Lord, the God of Israel, for he has come to his people and made them free,
chr: ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏱᎰᏩ ᎤᏁᎳᏅᎯ ᎢᏏᎵ ᎤᎾᏤᎵᎦ; ᏚᏩᏛᎰᎸᏰᏃ ᎠᎴ ᏚᎫᏴᎲ ᏧᏤᎵᎦ ᏴᏫ.

source: Lifting up a horn of salvation for us in the house of his servant David,
chr: ᎠᎴ ᎢᎩᎾᏄᎪᏫᏎᎸ ᎤᏲᏅ ᎢᎦᎵᏍᏕᎸᏙᏗ, ᏕᏫ ᎤᏅᏏᏓᏍᏗ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᎠᏁᎲ ᎤᎾᏄᎪᏨ;

source: (As he said, by the mouth of his holy prophets, from the earliest times,)
chr: ᎾᏍᎩᏯ ᏄᏪᏒ ᏕᎬᏗᏍᎬ ᏧᏤᎵ ᎨᏥᎸᏉᏗ ᎠᎾᏙᎴᎰᏍᎩ ᎤᎾᏕᏅᎯ ᏥᎩ ᏗᏓᎴᏂᏍᎬ ᏅᏓᎬᏩᏓᎴᏅᏛ;

source: Salvation from those who are against us, and from the hands of those who have hate for us;
chr: ᎾᏍᎩ ᏗᏓᏚᏓᎳᎡᏗᏱ ᎨᎩᏍᎦᎩ, ᎠᎴ ᎠᏍᏓᏯ ᏂᎨᎬᏅ ᏗᏓᏚᏓᎳᎡᏗᏱ ᏂᎦᏗᏳ ᎨᎩᏂᏆᏘᎯ;

source: To do acts of mercy to our fathers and to keep in mind his holy word,
chr: ᎢᏳᏛᏁᏗᏱ ᏚᏚᎢᏍᏓᏁᎸ ᏗᎩᎦᏴᎵᎨ ᏧᏪᏙᎵᏍᏗᏱ, ᎠᎴ ᎤᏅᏓᏗᏍᏗᏱ ᎤᏤᎵ ᎦᎸᏉᏗᏳ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ,

source: The oath which he made to Abraham, our father,
chr: ᎾᏍᎩ ᏧᏎᎵᏔᏁ ᏧᏚᎢᏍᏓᏁᎴ ᎢᎩᎦᏴᎵᎨ ᎡᏆᎭᎻ,

source: That we, being made free from the fear of those who are against us, might give him worship,
chr: ᎾᏍᎩ ᎨᏓᏚᏓᎳᎡᎸᎯ ᎨᏒ ᎨᎩᏍᎦᎩ ᎢᎦᎵᏍᎪᎸᏓᏁᏗᏱ ᏂᏗᎾᏰᏍᎬᎾ ᎡᏓᏓᏙᎵᏍᏓᏁᏗᏱ,

source: In righteousness and holy living before him all our days.
chr: ᏂᏗᏍᎦᏅᎾ ᎠᎴ ᏚᏳᎪᏛ ᎢᎨᏓᏍᏗᏱ ᎠᎦᏔᎲ ᏂᎪᎯᎸ ᎢᏓᎴᏂᏙᎲᎢ.

source: And you, child, will be named the prophet of the Most High: you will go before the face of the Lord, to make ready his ways;
chr: ᏂᎯᏃ ᎯᏲᎵ, ᏩᏍᏛ ᎦᎸᎳᏗᏳ ᎡᎯ ᎤᏤᎵ ᎠᏙᎴᎰᏍᎩ ᎡᏦᏎᎮᏍᏗ, ᏂᎯᏰᏃ ᎢᎬᏱ ᏘᏰᏅᎡᎵ ᏱᎰᏩ, ᎯᏯᏛᏅᎢᏍᏓᏁᏗᏱ ᎤᎶᎯᏍᏗᏱ;

source: To give knowledge of salvation to his people, through the forgiveness of sins,
chr: ᎬᏂᎨᏒ ᎢᏧᏩᏁᏗᏱ ᏧᏤᎵ ᏴᏫ ᎾᏍᎩ ᎤᎾᎵᏍᏕᎸᏙᏗ ᎨᏒᎢ, ᎦᎨᏥᏁᎲ ᎤᏂᏍᎦᏅᏨᎢ,

source: Because of the loving mercies of our God, by which the dawn from heaven has come to us,
chr: ᏱᎰᏩ ᎤᏓᏙᎵᏣᏘᏳ ᎨᏒ ᎢᎦᏁᎳᏅᎯ, ᎾᏍᎩ ᏥᏂᎦᎵᏍᏙᏗᎭ ᎢᎦᎦᏘ ᏗᏰᎵᎯᏍᏗᏍᎩ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ ᎢᎩᏩᏛᎯᎸᎯ ᏥᎩ,

source: To give light to those in dark places, and in the shade of death, so that our feet may be guided into the way of peace.
chr: ᎢᎦ ᏧᏘᏍᏓᏁᏗᏱ ᎤᎵᏏᎬ ᎠᎴ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᏓᏩᏗᏍᏙᏛ ᏣᏂᎾ, ᎠᎴ ᏗᎦᏖᏅᏍᏗᏱ ᏅᏩᏙᎯᏯᏛ ᎦᏅᏅᎢ.

source: And the child became tall, and strong in spirit; and he was living in the waste land till the day when he came before the eyes of Israel.
chr: ᎠᏲᎵᏃ ᎠᏛᏍᎨᎢ ᎠᎴ ᎧᏁᏉᎨ ᎤᎵᏂᎪᏍᎬ ᎤᏓᏅᏛᎢ, ᎠᎴ ᎢᎾᎨᏉ ᎡᎮᎢ ᎬᏂ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎸ ᎢᏏᎵ.

source: Now it came about in those days that an order went out from Caesar Augustus that there was to be a numbering of all the world.
chr: ᎾᎯᏳᏃ ᎯᎠ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᏏᏌ ᎣᎦᏍᏓ ᎤᏁᏨᎯ ᎤᎾᏄᎪᏤ ᏂᎬᎾᏛ ᎡᎶᎯ ᎨᎦᏎᏍᏗᏱ.

source: This was the first numbering, which was made when Quirinius was ruler of Syria.
chr: ᎾᏍᎩ ᎯᎠ ᎤᎾᏎᎵᏙᎴ ᎠᏏ ᏌᎵᏂ ᏏᎵᏱ ᎤᎬᏫᏳᎯ ᏂᎨᏒᎾ ᏂᎨᏎᎢ.

source: And all men went to be numbered, everyone to his town.
chr: ᎠᎴ ᏂᎦᏛ ᎤᏁᏅᏎ ᎨᎦᏎᏍᏗᏱ ᎠᏂᏏᏴᏫᎭ ᎨᏒ ᏙᏓᏂᏚᎲᎢ.

source: And Joseph went up from Galilee, out of the town of Nazareth, into Judaea, to Beth-lehem, the town of David, because he was of the house and family of David,
chr: ᎠᎴ ᏦᏩ ᎾᏍᏉ ᎨᎵᎵ ᎤᏂᎩᏎᎢ ᎤᏄᎪᏤ ᎾᏎᎵᏗ ᎦᏚᎲᎢ, ᏭᎷᏤ ᏧᏗᏱ, ᏕᏫ ᏧᏪᏚᎲᎢ, ᎦᏚᏱ ᏧᏙᎢᏛ, ᏕᏫᏰᏃ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᎨᏎᎢ ᎤᎦᏴᎵᎨ ᎨᏎᎢ ᎠᎴ ᏕᏫ,

source: To be put on the list with Mary, his future wife, who was about to become a mother.
chr: ᎨᎦᏎᏍᏗᏱ ᎤᏰᎸᏎ ᎤᏩᏒ ᎠᎴ ᎺᎵ ᎤᏓᏴᏍᏗ, ᎾᏍᎩ ᎦᏁᎵᏛ ᎨᏎᎢ.

source: And while they were there, the time came for her to give birth.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎠᏏ ᎾᎿ ᎠᏁᏙᎮᎢ, ᎤᏍᏆᎸᎮ ᎠᏲᎵ ᎤᎾᏄᎪᏫᏍᏗᏱ.

source: And she had her first son; and folding him in linen, she put him to rest in the place where the cattle had their food, because there was no room for them in the house.
chr: ᎤᎾᏄᎪᏫᏎᏃ ᎢᎬᏱ ᎡᎯ ᎤᏪᏥ ᎠᏧᏣ, ᎠᎴ ᎤᏪᏣᏄᎳᏁᎢ, ᎠᎴ ᏐᏈᎵ ᎤᎾᎵᏍᏓᏴᏗᏱ ᎤᎸᏁᎢ; ᎥᏝᏰᏃ ᏳᏜᏅᏕ ᏧᏂᏒᏍᏗᏱ ᎠᏓᏁᎸᎢ.

source: And in the same country there were keepers of sheep in the fields, watching over their flock by night.
chr: ᎾᎿᏃ ᎾᎥᎢ ᎠᏫ-ᏗᏂᎦᏘᏯ ᎠᏁᏙᎮ ᎤᏜᏅᏛᎢ, ᎠᏫ ᏓᏂᎦᏘᏰ ᏒᏃᏱ.

source: And an angel of the Lord came to them, and the glory of the Lord was shining round about them: and fear came on them.
chr: ᎬᏂᏳᏉᏃ ᏗᎧᎿᏩᏗᏙᎯ ᏱᎰᏩ ᎤᏤᎵᎦ ᎤᏂᎷᏤᎴᎢ, ᎠᎴ ᎦᎸᏉᏗᏳ ᏚᎸᏌᏛ ᎤᎬᏫᏳᎯ ᎤᏤᎵᎦ ᏚᎾᏚᏫᏍᏔᏁᎢ ᎠᎴ ᎤᏣᏔᏅᎯ ᎤᏂᏍᎦᎴᎢ.

source: And the angel said, Have no fear; for truly, I give you good news of great joy which will be for all the people:
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᏞᏍᏗ ᏱᏥᏍᎦᎢᎮᏍᏗ, ᎬᏂᏳᏉᏰᏃ ᎢᏨᏲᎯᏏ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏣᏘ ᎠᎵᎮᎵᏍᏗ, ᎾᏂᎥ ᏴᏫ ᎤᎾᏛᎪᏗ.

source: For on this day, in the town of David, a Saviour has come to birth, who is Christ the Lord.
chr: ᎪᎯᏰᏃ ᎢᎦ ᎢᏣᏕᏁᎸ ᏕᏫ ᎤᏪᏚᎲᎢ, ᎢᏥᏍᏕᎵᏍᎩ ᎾᏍᎩ ᎦᎶᏁᏛ ᎤᎬᏫᏳᎯ.

source: And this is the sign to you: you will see a young child folded in linen, in the place where the cattle have their food.
chr: ᎯᎠᏃ ᎾᏍᎩ ᎢᏣᏙᎯᎰᎯᏍᏙᏗ ᎨᏎᏍᏗ; ᏓᏰᏥᏩᏛᎯ ᎠᏲᎵ ᎠᏥᏣᏄᎴᏍᏗ, ᏐᏈᎵ ᎤᎾᎵᏍᏓᏴᏗᏱ ᎦᏅᎨᏍᏗ.

source: And suddenly there was with the angel a great band of spirits from heaven, giving praise to God, and saying,
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎤᏂᏣᏘ ᎦᎸᎳᏗ ᎠᏁᎯ ᎬᏩᎵᎪᏁᎴ ᏗᎧᎿᏩᏗᏙᎯ, ᎤᏁᎳᏅᎯ ᎠᏂᎸᏉᏗᏍᎨᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ;

source: Glory to God in the highest, and on the earth peace among men with whom he is well pleased.
chr: ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᏩᏍᏛ ᎦᎸᎳᏗᏳ, ᎡᎶᎯᏃ ᏙᎯᎣ ᎨᏎᏍᏗ, ᎣᏍᏛ ᎨᎦᏓᏅᏖᏍᎨᏍᏗ ᏴᏫ.

source: And when the angels had gone away from them into heaven, the keepers of the sheep said to one another, Let us go now to Beth-lehem, and see this thing which has come about, which the Lord has made clear to us.
chr: ᎿᏉᏃ ᎯᎠ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎬᏩᎾᏓᏅᎡᎸ, ᎦᎸᎳᏗ ᏫᎤᏂᎶᏒ, ᎯᎠ ᏂᏚᎾᏓᏪᏎᎴ ᎠᏫ-ᏗᏂᎦᏘᏯ; Ꭷ, ᎿᏉ ᎦᏚᏱ ᎢᏕᎾ, ᎠᎴ ᏫᏓᏙᎴᎰᎯ ᎾᏍᎩ ᎯᎠ ᏄᎵᏍᏔᏅᎢ, ᎾᏍᎩ ᏱᎰᏩ ᎬᏂᎨᏒ ᏥᏂᎬᏂᏏ.

source: And they came quickly, and saw Mary and Joseph, and the child in the place where the cattle had their food.
chr: ᎤᎵᏍᏗᏳᏃ ᏭᏂᎷᏤᎢ, ᎠᎴ ᏚᏂᏩᏛᎮ ᎺᎵ ᎠᎴ ᏦᏩ, ᎠᎴ ᎠᏲᎵ ᏐᏈᎵ ᎤᎾᎵᏍᏓᏴᏗᏱ ᎦᏅᎨᎢ.

source: And when they saw it, they gave them an account of the things which had been said to them about the child.
chr: ᎤᏂᎪᎲᏃ ᎤᏂᏃᎮᎵᏙᎴ ᏄᏍᏛ ᎨᏥᏃᎮᎮᎸ ᎾᏍᎩ ᎠᏲᎵ ᎠᏥᏁᎢᏍᏗᏍᎬᎢ.

source: And all those to whose ears it came were full of wonder at the things said by the keepers of the sheep.
chr: ᏂᎦᏛᏃ ᎤᎾᏛᎦᏅᎯ ᎤᏂᏍᏆᏂᎪᏎ ᏄᏍᏛ ᎬᏩᏂᏃᎮᎮᎸ ᎠᏫ-ᏗᏂᎦᏘᏯ.

source: But Mary kept all these words in her heart, and gave much thought to them.
chr: ᎺᎵᏍᎩᏂ ᎾᏍᎩ ᎯᎠ ᏂᎦᏛ ᎤᏍᏆᏂᎪᏔᏁᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏓᏅᏖᎯᎶᎡ ᏧᏓᏅᏛᎢ.

source: Then the keepers of the sheep went back, giving glory and praise to God for all the things which had come to their ears and which they had seen, as it had been said to them.
chr: ᎠᏫᏃ-ᏗᏂᎦᏘᏯ ᎢᎤᎾᏨᏎᎢ, ᎠᏂᎸᏉᏗᏍᎨ ᎠᎴ ᎠᎾᎵᎮᎵᏤᎮ ᎤᏁᎳᏅᎯ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏂᎦᎥ ᎤᎾᏛᎦᏅ ᎠᎴ ᎤᏂᎪᎲᎢ, ᎾᏍᎩ ᏄᏍᏛ ᎨᏥᏃᏁᎸᎢ.

source: And when, after eight days, the time came for his circumcision, he was named Jesus, the name which the angel had given to him before his birth.
chr: ᏧᏁᎵᏁᏃ ᎢᎦ ᎤᏍᏆᎸᎲ ᎾᏍᎩ ᎠᎱᏍᏕᏎᏗ ᎨᏒ ᎠᏲᎵ, ᏥᏌ ᏚᏃᎡᎢ, ᎾᏍᎩ ᏗᎧᎿᏩᏗᏙᎯ ᏂᏚᏬᎡ ᎠᏏᏉ ᎾᏥᏁᎵᎬᎾ ᎨᏎᎢ.

source: And when the necessary days for making them clean by the law of Moses had come to an end, they took him to Jerusalem to give him to the Lord
chr: ᎿᏉᏃ ᎤᏍᏆᎸᎲ ᎤᎾᏓᏅᎦᎸᏗᏱ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ ᎼᏏ ᎤᏬᏪᎳᏅᎯ, ᏥᎷᏏᎵᎻ ᎤᏂᏃᎴ ᏱᎰᏩ ᎤᏂᎧᏁᏗᏱ;

source: (As it says in the law of the Lord, Every mother's first male child is to be holy to the Lord),
chr: ᎾᏍᎩᏯ ᏂᎬᏅ ᎪᏪᎸ ᏗᎧᎿᏩᏛᏍᏗᏱ ᎼᎰᏩ ᏣᏥᎵᎦ; ᎾᏂᎥ ᎢᎬᏱ ᎤᎾᏕᏅᎯ ᎠᏂᏍᎦᏯ ᏱᎰᏩ ᏣᏥᏲᎯᏎᎸᎯ ᎨᎪᏎᎮᏍᏗ;

source: And to make an offering, as it is ordered in the law of the Lord, of two doves or other young birds.
chr: ᎠᎴ ᎠᏥᎸ-ᎨᎳᏍᏗ ᎤᎾᎵᏍᎪᎸᏙᏗᏱ ᎾᏍᎩᏯ ᎯᎠ ᏂᎦᏪᏍᎬ ᏗᎧᎿᏩᏛᏍᏗ ᏱᎰᏩ ᎤᏤᎵᎦ; ᎠᏂᏔᎵ ᏧᎴᏗᏂᏍᎪᏂᎯ, ᎠᎴ ᎠᏂᏔᎵ ᎠᏂᏛ ᏬᏱ.

source: And there was then in Jerusalem a man whose name was Simeon; and he was an upright man, fearing God and waiting for the comfort of Israel: and the Holy Spirit was on him.
chr: ᎠᎴ ᎬᏂᏳᏉ ᎩᎶ ᎢᏳᏍᏗ ᎠᏍᎦᏯ ᏥᎷᏏᎵᎻ ᎡᎮ ᏏᎻᏯᏂ ᏧᏙᎢᏛ; ᎠᎴ ᎾᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎠᎴ ᎤᏁᎳᏅᎯ ᏗᎧᎿᏩᏕᎩ ᎨᏎᎢ, ᎠᎦᏘᏰ ᎢᏏᎵ ᎨᏥᏄᏬᎯᏍᏙᏗᏱ; ᎦᎸᏉᏗᏳᏃ ᎠᏓᏅᏙ ᏔᎵ ᎤᏛᏗᏕᎨᎢ.

source: And he had knowledge, through the Holy Spirit, that he would not see death till he had seen the Lord's Christ.
chr: ᎠᎴ ᎬᏂᎨᏒ ᎢᏳᏩᏁᎸᎯ ᎨᏎ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎾᏍᎩ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᎪᏩᏛᏗ ᏂᎨᏒᎾ ᎨᏒ ᎬᏂ ᏱᎰᏩ ᎤᏤᎵ ᎦᎶᏁᏛ ᎤᎪᎲᎯ ᏱᎩ

source: And full of the Spirit he came into the Temple; and when the father and mother came in with the child Jesus, to do with him what was ordered by the law,
chr: ᎠᎴ ᎠᏓᏅᏙ ᎤᏓᏅᏖᎮᎸᎯ ᏭᎷᏤ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ; ᏧᎦᏴᎵᎨᏃ ᎤᏂᏴᏔᏂᎸ ᎠᏲᎵ ᏥᏌ ᎾᏍᎩ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ ᎢᏳᎾᏛᏁᏗᏱ,

source: Then he took him in his arms and gave praise to God and said,
chr: ᎿᏉ ᎾᏍᎩ ᎤᏁᏎᎢ, ᎠᎴ ᎤᎸᏉᏔᏁ ᎤᏁᎳᏅᎯ, ᎯᎠ ᏄᏪᏎᎢ;

source: Now you are letting your servant go in peace, O Lord, as you have said;
chr: ᏣᎬᏫᏳᎯ, ᎿᏉ ᎯᏅᏏᏓᏍᏗ ᏅᏩᏙᎯᏯᏛ ᏕᎯᏲᏍᎦ, ᎾᏍᎩᏯ ᏂᏣᏪᏒ ᏣᏁᏨᎢ;

source: For my eyes have seen your salvation,
chr: ᏗᏥᎦᎵᏰᏃ ᎬᏗ ᏥᎪᏩᏛ ᏣᏤᎵ ᎠᎵᏍᏕᎸᏙᏗ.

source: Which you have made ready before the face of all nations;
chr: ᎾᏍᎩ ᏣᏓᏁᎳᏅᎯ ᏥᎩ ᎾᏂᎥ ᏴᏫ ᎠᏂᎦᏔᎲᎢ,

source: A light of revelation to the Gentiles, and the glory of your people Israel.
chr: ᎢᎦ-ᎦᏘ ᏧᏂᎸᏌᏓᏕᏗ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ ᏗᏣᏤᎵ ᏴᏫ ᎢᏏᎵ ᎤᎾᏤᎵᎦ.

source: And his father and mother were full of wonder at the things which were said about him.
chr: ᏦᏩᏃ ᎠᎴ ᎠᏲᎵ ᎤᏥ ᎠᏂᏍᏆᏂᎪᏍᎨ ᏄᏍᏛ ᎠᏥᏁᎢᏍᏗᏍᎬ ᎾᏍᎩ.

source: And Simeon gave them his blessing and said to Mary, his mother, See, this child will be the cause of the downfall and the lifting up of great numbers of people in Israel, and he will be a sign against which hard words will be said;
chr: ᎻᎻᏯᏂᏃ ᎣᏍᏛ ᏚᏁᏤᎴᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴ ᎺᎵ ᎠᏲᎵ ᎤᏥ, ᎬᏂᏳᏉ ᎯᎠ ᎾᏍᎩ ᎠᏲᎵ ᎠᏥᎧᏅ ᎾᏍᎩ ᎢᏏᎵ ᎠᏁᎯ ᎤᏂᏣᏘ ᏧᏂᏅᎢᏍᏗᏱ ᎠᎴ ᏧᎾᎴᎯᏐᏙᏗᏱ; ᎠᎴ ᎤᏰᎸᏛ ᎤᎾᏡᏙᏗ ᎠᏂᏬᏂᏍᎬᎢ.

source: (And a sword will go through your heart;) so that the secret thoughts of men may come to light.
chr: ᎾᏍᎩ ᎤᏂᏣᏘ ᏄᏍᏛ ᏓᎾᏓᏅᏖᏍᎬ ᏧᏂᎾᏫᏱ ᎬᏂᎨᏒ ᎢᏳᎵᏍᏙᏗᏱ: ᎥᎥ, ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎾᏍᏉ ᏨᏒ ᏣᏓᏅᏙ ᏓᏣᏘᎵ.

source: And there was one, Anna, a woman prophet, the daughter of Phanuel, of the family of Asher (she was very old, and after seven years of married life
chr: ᎠᎴ ᎩᎶ ᎢᏳᏍᏗ ᎠᎨᏴ ᎡᏂ ᏧᏙᎢᏛ ᎠᏙᎴᎰᏍᎩ ᎡᎮᎢ, ᎾᏍᎩ ᏆᏄᎡᎵ ᎤᏪᏥ ᎨᏎᎢ, ᎡᏌ ᎠᏂᎳᏍᏓᎸ ᎤᏠᏱ, ᎾᏍᎩ ᎤᏣᏘ ᎠᎦᏴᎵᎨ ᎨᏎᎢ, ᎠᎴ ᎦᎵᏉᎩ ᎢᏧᏕᏘᏴᏛ ᎤᎾᏁᎳᏛᎯ ᎨᏎ ᎠᏍᎦᏯ ᎠᏛᏉ ᎨᏒ ᏧᎾᏨᏛ;

source: She had been a widow for eighty-four years); she was in the Temple at all times, worshipping with prayers and going without food, night and day.
chr: ᎠᎴ ᎤᏬᏑᎶᏨᎯ ᎨᏎ ᏁᎳᏍᎪᎯ ᏅᎩᎦᎵ ᎢᏴᏛ ᎢᏳᏕᏘᏴᏛ, ᎾᏍᎩ ᎥᏝ ᏱᏓᏅᏍᎨ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎤᏁᎳᏅᎯᏉ ᏓᎧᎿᏩᏗᏎᎢ ᎠᎹᏟ ᎬᏍᎬ ᎠᎴ ᎠᏓᏙᎵᏍᏗᏍᎬ ᏂᏚᎵᏏᏂᏒ ᎠᎴ ᏂᏚᎩᏨᏂᏒᎢ.

source: And coming up at that time, she gave praise to God, talking of him to all those who were waiting for the freeing of Jerusalem.
chr: ᎾᏍᎩᏃ ᎾᏍᏉ ᎾᎯᏳᏉ ᎤᎷᏤ ᎤᎵᎮᎵᏤᎴ ᏱᎰᏩ, ᎠᎴ ᎾᏍᎩ ᏕᎧᏁᎢᏍᏓᏁᎮ ᎾᏂᎥᏉ ᏥᎷᏏᎵᎻ ᎠᏁᎯ ᎠᏂᎦᏖᏃᎯ ᎠᎫᏴᏙᏗ ᎨᏒ ᎤᎾᏄᎪᎢᏍᏗᏱ.

source: And when they had done all the things which were ordered by the law of the Lord, they went back to Galilee, to Nazareth, the town where they were living.
chr: ᎤᏂᏍᏆᏛᏃ ᏂᎦᏛ ᎢᏯᏛᏁᎵᏓᏍᏗ ᎨᏒ ᎾᏍᎩᏯ ᏂᎬᏅ ᏗᎧᎿᏩᏛᏍᏗ ᏱᎰᏩ ᎤᏤᎵᎦ, ᎢᎤᎾᏨᏎ ᎨᎵᎵ ᏭᏂᎶᏎ, ᎤᏅᏒ ᏧᏂᏚᎲ ᎾᏎᎵᏗ ᏭᏂᎷᏤᎢ.
